In [1]:
import pandas as pd

In [2]:
nm=["abc","pqr","xyz"]
d=pd.DataFrame(nm)
d

     0
0  abc
1  pqr
2  xyz

In [3]:
info={"ID":[1,2,3,4],"Name":["chaitu","priya","utkarsha","shravi"],"Age":[20,21,20,21]};
infor=pd.DataFrame(info)
infor

   ID      Name  Age
0   1    chaitu   20
1   2     priya   21
2   3  utkarsha   20
3   4    shravi   21

In [11]:
##loc //used for location ....access labeled data
info.iloc[1:7:[0,2]]

In [14]:
info={"ID":[1,2,3,4],"Name":["chaitu","priya","utkarsha","shravi"],"Age":[20,21,20,21]};
data=pd.DataFrame(info,index=[101,102,103,104])   #index we can change
print(data)
print(" ")
print("loc parameter for accessing some rows and columns of data")
print(data.loc[102:104,["Name"]])  
print(" ")

     ID      Name  Age
101   1    chaitu   20
102   2     priya   21
103   3  utkarsha   20
104   4    shravi   21

loc parameter for accessing some rows and columns of data
         Name
102     priya
103  utkarsha
104    shravi

# Descriptive Analysis

groupby():
-the groupby method allow you to groups rows of the data together and call aggrigate function
-we can use differnt aggrigate function such as mean(),sum(),max(),min(),count()

In [26]:
import pandas as pd
data={"company":["Google","Google","Microsoft","Microsoft","FB","FB"],
     "person":["sam","ram","danish","pratik","Aish","rohit"],"sales":[200,230,230,420,525,500]}
df=pd.DataFrame(data)
df

     company  person  sales
0     Google     sam    200
1     Google     ram    230
2  Microsoft  danish    230
3  Microsoft  pratik    420
4         FB    Aish    525
5         FB   rohit    500

In [27]:
df.groupby("company").max()

           person  sales
company
FB          rohit    525
Google        sam    230
Microsoft  pratik    420

In [28]:
df.groupby("company").sum()

C:\Users\Admin\AppData\Local\Temp\ipykernel_5352\3128476385.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("company").sum()

           sales
company
FB          1025
Google       430
Microsoft    650

In [29]:
df.groupby("company").min()

           person  sales
company
FB           Aish    500
Google        ram    200
Microsoft  danish    230

describe():
  it is used for display the summery of whole dataset

In [30]:
df.groupby("company").describe()

          sales
          count   mean         std    min     25%    50%     75%    max
company
FB          2.0  512.5   17.677670  500.0  506.25  512.5  518.75  525.0
Google      2.0  215.0   21.213203  200.0  207.50  215.0  222.50  230.0
Microsoft   2.0  325.0  134.350288  230.0  277.50  325.0  372.50  420.0

In [31]:
df.describe()

            sales
count    6.000000
mean   350.833333
std    147.865367
min    200.000000
25%    230.000000
50%    325.000000
75%    480.000000
max    525.000000

In [32]:
print("\n grouping by column and listing sum of sales")

 grouping by column and listing sum of sales

In [33]:
df.groupby('company').describe().loc["FB"].transpose()

sales  count      2.00000
       mean     512.50000
       std       17.67767
       min      500.00000
       25%      506.25000
       50%      512.50000
       75%      518.75000
       max      525.00000
Name: FB, dtype: float64

In [34]:
(pd.DataFrame(df.groupby('company').describe().loc["FB"].transpose()))

                    FB
sales count    2.00000
      mean   512.50000
      std     17.67767
      min    500.00000
      25%    506.25000
      50%    512.50000
      75%    518.75000
      max    525.00000

In [35]:
print("\n grouping by column and listing sum of sales\n",'-'*60,sep='')

 grouping by column and listing sum of sales
------------------------------------------------------------

In [36]:
d=(pd.DataFrame(df.groupby('company').describe().loc["FB"]).transpose())    #DataFrame is used for rows and cols
d
print("")
e=(pd.DataFrame(df.groupby('company').describe().loc["Microsoft"]).transpose())
e

          sales
          count   mean         std    min    25%    50%    75%    max
Microsoft   2.0  325.0  134.350288  230.0  277.5  325.0  372.5  420.0

In [37]:
df.head()

     company  person  sales
0     Google     sam    200
1     Google     ram    230
2  Microsoft  danish    230
3  Microsoft  pratik    420
4         FB    Aish    525

In [38]:
df.head(3)   #for showing  some  rows of data according user

     company  person  sales
0     Google     sam    200
1     Google     ram    230
2  Microsoft  danish    230

In [39]:
df.info()   #show all information or details of the data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   company  6 non-null      object
 1   person   6 non-null      object
 2   sales    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [40]:
df.size()

TypeError: 'numpy.int32' object is not callable

In [41]:
df.shape()

TypeError: 'tuple' object is not callable

In [17]:
import pandas as pd
Data={"Food Name":["Veg Manchurian","veg pulav","veg bhuna","veg kolhapuri","paneer masala","Manchu soup","Khadhai panner"],
     "cost":[100,200,30,41,77,400,500],
     "Quantity":["200gm","100gm","300gm","NA","50gm","70gm","NA"]}


df=pd.DataFrame(Data)
df["code"]="1 2 3 4 5 6 7".split()
df

        Food Name  cost Quantity code
0  Veg Manchurian   100    200gm    1
1       veg pulav   200    100gm    2
2       veg bhuna    30    300gm    3
3   veg kolhapuri    41       NA    4
4   paneer masala    77     50gm    5
5     Manchu soup   400     70gm    6
6  Khadhai panner   500       NA    7

In [18]:

#set_index is used for setting one column as index of that dataframe
df.set_index("cost",inplace=True)
df     #df["cost"].sum()....also we check min(),max(),count(),index()

           Food Name Quantity code
cost
100   Veg Manchurian    200gm    1
200        veg pulav    100gm    2
30         veg bhuna    300gm    3
41     veg kolhapuri       NA    4
77     paneer masala     50gm    5
400      Manchu soup     70gm    6
500   Khadhai panner       NA    7

In [24]:
df.values

array([['Veg Manchurian', '200gm', '1'],
       ['veg pulav', '100gm', '2'],
       ['veg bhuna', '300gm', '3'],
       ['veg kolhapuri', 'NA', '4'],
       ['paneer masala', '50gm', '5'],
       ['Manchu soup', '70gm', '6'],
       ['Khadhai panner', 'NA', '7']], dtype=object)

In [25]:
df.index

Int64Index([100, 200, 30, 41, 77, 400, 500], dtype='int64', name='cost')

# Unique

In [27]:
df["Food Name"].unique()

array(['Veg Manchurian', 'veg pulav', 'veg bhuna', 'veg kolhapuri',
       'paneer masala', 'Manchu soup', 'Khadhai panner'], dtype=object)

In [28]:
df.value_counts("Food Name")

Food Name
Khadhai panner    1
Manchu soup       1
Veg Manchurian    1
paneer masala     1
veg bhuna         1
veg kolhapuri     1
veg pulav         1
dtype: int64

In [29]:
df.columns

Index(['Food Name', 'Quantity', 'code'], dtype='object')

# Working with Missing Data

For convient method to deal with missing data in pandas

In [30]:
print("\n Droping a roe with a Nan value \n",'-'*38,sep='')  #sep used fo rtaking the space or seprator

 Droping a roe with a Nan value
--------------------------------------

In [31]:
import pandas as pd
import numpy as np

In [33]:
df=pd.DataFrame({"A":[1,2,np.nan],"B":[5,np.nan,np.nan],"C":[1,2,3],"D":[3,np.nan,np.nan]})

df['state']="aa bb cc".split()
df.set_index('state',inplace=True)

df

         A    B  C    D
state
aa     1.0  5.0  1  3.0
bb     2.0  NaN  2  NaN
cc     NaN  NaN  3  NaN

In [19]:
#Merging two data frame
#creating data frame

import pandas as pd
df1=pd.DataFrame({ 'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3'] },
index=[0,1,2,3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [21]:
df=df1[["A","B"]]
df

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [25]:
#Concatenation 

df_cart1=pd.concat([df,df1],axis=0)
print("\nAfter concatenation along row\n",'-'*30,sep='')
print(df_cart1)
print("")
print(df_cart.loc[1])
print("")
df_cart.iloc[1]

After concatenation along row
------------------------------
    A   B    C    D
0  A0  B0  NaN  NaN
1  A1  B1  NaN  NaN
2  A2  B2  NaN  NaN
3  A3  B3  NaN  NaN
0  A0  B0   C0   D0
1  A1  B1   C1   D1
2  A2  B2   C2   D2
3  A3  B3   C3   D3

NameError: name 'df_cart' is not defined

In [20]:
import pandas as pd
left=pd.DataFrame({'key':['k0','k1','k2','k3'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']
                  
                  })
right=pd.DataFrame({'key':['k0','k1','k2','k3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3'] 
                  })
print(left)

  key   A   B
0  k0  A0  B0
1  k1  A1  B1
2  k2  A2  B2
3  k3  A3  B3

In [7]:
print(right)

  key   C   D
0  k0  C0  D0
1  k1  C1  D1
2  k2  C2  D2
3  k3  C3  D3

In [17]:
merge1=pd.merge(left,right,how='inner',on='key')
print("\nAfter simple merging with method\n",'-'*30,sep="")
print(merge1)

After simple merging with method
------------------------------
  key   A   B   C   D
0  k0  A0  B0  C0  D0
1  k1  A1  B1  C1  D1
2  k2  A2  B2  C2  D2
3  k3  A3  B3  C3  D3

In [16]:
merge1=pd.merge(left,right,how='outer',on='key')
print("\nAfter simple merging with method\n",'-'*30,sep="")
print(merge1)

After simple merging with method
------------------------------
  key   A   B   C   D
0  k0  A0  B0  C0  D0
1  k1  A1  B1  C1  D1
2  k2  A2  B2  C2  D2
3  k3  A3  B3  C3  D3

# Concatenation: 
-It is

In [3]:
import pandas as pd
left=pd.DataFrame({"key1":["k0","k1","k1","k2"],
                   "key2":["k0","k1","k0","k1"],
                   "A":["A0","A1","A2","A3"],
                   "B":["B0","B1","B2","B3"]  })

In [4]:
right=pd.DataFrame({"key1":["k0","k1","k1","k2"],
                   "key2":["k0","k0","k0","k0"],
                   "C":["C0","C1","C2","C3"],
                   "D":["D0","D1","D2","D3"]  })

In [5]:
left

  key1 key2   A   B
0   k0   k0  A0  B0
1   k1   k1  A1  B1
2   k1   k0  A2  B2
3   k2   k1  A3  B3

In [6]:
right

  key1 key2   C   D
0   k0   k0  C0  D0
1   k1   k0  C1  D1
2   k1   k0  C2  D2
3   k2   k0  C3  D3

In [7]:
pd.merge(left,right,on=["key1","key2"])

  key1 key2   A   B   C   D
0   k0   k0  A0  B0  C0  D0
1   k1   k0  A2  B2  C1  D1
2   k1   k0  A2  B2  C2  D2

In [8]:
pd.merge(left,right,how='left',on=["key1","key2"])

  key1 key2   A   B    C    D
0   k0   k0  A0  B0   C0   D0
1   k1   k1  A1  B1  NaN  NaN
2   k1   k0  A2  B2   C1   D1
3   k1   k0  A2  B2   C2   D2
4   k2   k1  A3  B3  NaN  NaN

In [9]:
pd.merge(left,right,how='right',on=["key1","key2"])

  key1 key2    A    B   C   D
0   k0   k0   A0   B0  C0  D0
1   k1   k0   A2   B2  C1  D1
2   k1   k0   A2   B2  C2  D2
3   k2   k0  NaN  NaN  C3  D3

# Joining:
-It is convinient method for combined of colunms of potentailly different indexd DataFrame into a single result DataFrame

In [12]:
import pandas as pd
left=pd.DataFrame({'A':['A0','A1','A2'],
                  'B':['B0','B1','B2']},
index=['K0','K1','K2'])

In [14]:
right=pd.DataFrame({'C':['C0','C1','C2'],
                    'D':['D0','D1','D2']},
        index=['K0','K2','K3'])

In [15]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [16]:
right

     C   D
K0  C0  D0
K2  C1  D1
K3  C2  D2

In [17]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

In [18]:
right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C1  D1   A2   B2
K3  C2  D2  NaN  NaN

In [19]:
right.join(left,how='outer')

      C    D    A    B
K0   C0   D0   A0   B0
K1  NaN  NaN   A1   B1
K2   C1   D1   A2   B2
K3   C2   D2  NaN  NaN

In [20]:
right.join(left,how='inner')

     C   D   A   B
K0  C0  D0  A0  B0
K2  C1  D1  A2  B2

# Applying Function

In [21]:
import pandas as pd
import numpy as np

In [22]:
#Using of apply function
#define a function
def testfunc(x):
    if x>500:
        return 10*np.log(x)
    else:
        return(x/10)

In [26]:
df=pd.DataFrame({'col1':[1,2,3,4,5,6,7,8,9,10],
                'col2':[111,222,333,444,555,666,777,888,999,500],
                'col3':'aaa bbb cc ddd eee ff gg h ii jj'.split()})
df

   col1  col2 col3
0     1   111  aaa
1     2   222  bbb
2     3   333   cc
3     4   444  ddd
4     5   555  eee
5     6   666   ff
6     7   777   gg
7     8   888    h
8     9   999   ii
9    10   500   jj

# creating a new columns

In [31]:
df['funApplied']=df['col2'].apply(testfunc)
df

   col1  col2 col3  funApplied
0     1   111  aaa   11.100000
1     2   222  bbb   22.200000
2     3   333   cc   33.300000
3     4   444  ddd   44.400000
4     5   555  eee   63.189681
5     6   666   ff   65.012897
6     7   777   gg   66.554404
7     8   888    h   67.889717
8     9   999   ii   69.067548
9    10   500   jj   50.000000

In [33]:
df['col3length']=df['col3'].apply(len)
df

   col1  col2 col3  funApplied  col3length
0     1   111  aaa   11.100000           3
1     2   222  bbb   22.200000           3
2     3   333   cc   33.300000           2
3     4   444  ddd   44.400000           3
4     5   555  eee   63.189681           3
5     6   666   ff   65.012897           2
6     7   777   gg   66.554404           2
7     8   888    h   67.889717           1
8     9   999   ii   69.067548           2
9    10   500   jj   50.000000           2

In [ ]:
import pandas as pd
import numpy as np
df=pd.read("D:\chaitu")